[
  {
    "id": "project1",
    "title": "Euchre Card Game",
    "briefdescription": "A fully playable euchre card game featuring AI opponents, theme changes, and statistics tracking",
    "description": "This was a desktop application built in C# using .NET. The game was built using WPF and MVVM architecture. The application featured algorithmic AI opponents in 4-player gameplay. A user could view persistent statistics, which were stored and tracked in a local JSON file. The playing field was fully interactive via mouse-clicks, and featured detailed card images that changed positions on the gamebaord based on game actions. Various themes were also available, changing the style of the card backs and table-top.",
    "technologies": ["C#", ".NET", "WPF", "JSON", "MVVM", "GitHub"],
    "imageUrl": ["./images/project1/menu.png", "./images/project1/stats.png", "./images/project1/ingame.png", "./images/project1/ingametheme2.png", "./images/project1/playing.png"]
  },
  {
    "id": "project2",
    "title": "Customer Management System",
    "briefdescription": "A web-based Customer Management System aimed to provide a platform for any company tracking and managing a roster of customers.",
    "description": "A full-stack application offering modern authentication and authorization, with administrator capabilities. Data will be pulled from the database based on the who is signed in, and which customers fall within their jurisdiction. Allows for managing, editing, and viewing customer details.",
    "technologies": ["PHP", "HTML/CSS", "Apache", "mySQL"],
    "imageUrl": ["./images/project2/customer_app1.png", "./images/project2/customer_app2.png", "./images/project2/customer_app3.png", "./images/project2/customer_app4.png"]
  },
  {
    "id": "project3",
    "title": "USB-Connected Lock Control Application",
    "briefdescription": "An application to connect to a physical lock, fetch data from it's firmware, display and manipulate that data.",
    "description": "An application to connect to a physical lock, fetch data from it's firmware, display and manipulate that data.",
    "technologies": [".NET", "MAUI", "C#", "Firmware algorithms", "USB","CBOR"],
    "imageUrl": ["./images/project3/maui.png"]
  },
  {
    "id": "project4",
    "title": "Deveoper Portfolio Website (This Website!)",
    "briefdescription": "A front-facing website, meant to showcase a developer's work, other online profiles, background, and information.",
    "description": "This website is built with the NextJS, an emerging React framework that introduces some great new features. This website utilizes some of those features, such as static site generation (SSG), to pull data from JSON files, and render those pages at build time. This improves SEO optimization, as well as serve speed, which can enhance the user experience.",
    "technologies": ["NextJS", "React", "HTML/CSS", "JavaScript", "JSON"],
    "imageUrl": ["./images/project4/home.png"]
  }
]